[{"Abstract:":"Embodiments are disclosed that relate to providing an interactive video viewing experience. For example, one disclosed embodiment includes receiving an interactive video program that comprises a first video segment and one or more branch video segments that each corresponds to a branch along a decision path. The method includes pre-buffering a transition portion of a corresponding branch video segment for each possible user input of one or more possible user inputs along the decision path. The method includes sending the first video segment to a display device and, based upon an actual user input, branching from the first video segment to a transition portion of a branch video segment that corresponds to the actual user input.","Application Number:":"13\/275124","Assignee:":"Microsoft Corporation (Redmond, WA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1318809600000,"International Classes:":"H04N21\/472","Inventors:":"Stone, Brian (London, GB)                \n                            Johnson, Jerry (London, GB)                \n                            White, Matthew (Cambridgeshire, GB)                \n                            Atkins, Joshua Whitney Samuels (London, GB)","Other Classes:":null,"Primary Class:":"725\/61","Publication Date:":1366243200000,"Title:":"INTERACTIVE VIDEO"},{"Abstract:":"This invention relates to a two way video terminal having video screen and a video camera. The parallax distortion experienced with such terminals is eliminated by using a flat video screen (2) of the transparent type and with individual pixel control , and a video camera (3) which is positioned directly behind the video screen to 'look through' the video screen. The video screen (2) is switched between two modes of operation, - one display mode and one 'look-through' mode, by control means (4).","Application Number:":"EP19900102135","Assignee:":"ALCATEL NV (NL)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":634003200000,"International Classes:":"H04N5\/225; H04N5\/66; H04N7\/14; H04N7\/18; (IPC1-7): H04N7\/14","Inventors:":"Skow, Rune (NO)","Other Classes:":null,"Primary Class:":null,"Publication Date:":652492800000,"Title:":"Video terminal."},{"Abstract:":"The invention relates to a video encoding apparatus (100) comprising a video analysis processor (101) and a video encoder (103). The video analysis processor (101) comprises a segmentation processor (109) which divides a picture into a plurality of picture regions. A picture characteristic processor (111) determines picture characteristic, such as a texture level, for one of the regions, and in response a video encoding selector (113) selects a video encoding parameter for that region. The video encoding parameter is fed to the video encoder (103) wherein a video encode processor (I 19) encodes the picture using the video encoding parameter determined by the external analysis by the video analysis processor (101). The encoded picture is fed back to the video analysis processor (101) and the process is iterated until a desired encoding performance is achieved. The apparatus is particularly suitable for H.264 encoding and allows for improved performance from a selection of encoding parameters based on an external analysis.","Application Number:":"10\/547322","Assignee:":null,"Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1077667200000,"International Classes:":"G06K9\/36; G06T9\/00; H04K1\/06; H04N7\/26; H04N7\/50; H04N11\/04","Inventors:":"Burazerovic, Dzevdet (Eindhoven, NL)","Other Classes:":"375\/E7.13,                                    375\/E7.134,                                    375\/E7.135,                                    375\/E7.146,                                    375\/E7.161,                                    375\/E7.163,                                    375\/E7.167,                                    375\/E7.182,                                    375\/E7.189,                                    375\/E7.19,                                    375\/E7.194,                                    375\/E7.211,                                    380\/37,                                    375\/240.01","Primary Class:":"382\/239","Publication Date:":1158192000000,"Title:":"Video encoding"},{"Abstract:":"Panoramic video acquisition guidance is automatically provided as feedback during panoramic video capture. Commensurate with receiving a panoramic video being captured, at least one panoramic video acquisition guidance indicator is provided. This panoramic video guidance acquisition indicator(s) provides real-time acquisition feedback on the panoramic video being captured, and is based, at least in part, on the panoramic video being captured or movement of a video capture device capturing the panoramic video. In one or more implementations, the panoramic video guidance indicator may include a video rotation progress indicator, a video tilt or video pitch indicator, and\/or a video rotation speed indicator.","Application Number:":"13\/553991","Assignee:":"GOOGLE Inc. (Mountain View, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1342742400000,"International Classes:":"H04N5\/232; H04N7\/00","Inventors:":"Yatziv, Liron (Sunnyvale, CA, US)                \n                            Ogale, Abhijit (Mountain View, CA, US)                \n                            Royz, Gadi (San Francisco, CA, US)                \n                            Amira, Rony (Rishon Lesion, IL)                \n                            Matias, Yossi (Tel Aviv, IL)                \n                            Seltzer, Misha (Kfar Saba, IL)","Other Classes:":"348\/36,                                    348\/E7.001","Primary Class:":"348\/37","Publication Date:":1430956800000,"Title:":"PANORAMIC VIDEO ACQUISITION GUIDANCE"},{"Abstract:":"Methods, devices, systems and\/or storage media for stereoscopic video.","Application Number:":"10\/058962","Assignee:":"ABRAMS THOMAS ALGIE","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1012176000000,"International Classes:":"H04N13\/00; H04N15\/00; (IPC1-7): H04N15\/00; H04N11\/04","Inventors:":"Thomas Jr., Algie Abrams (Snohomish, WA, US)","Other Classes:":"348\/E13.014,                                    348\/E13.04,                                    348\/E13.041,                                    348\/E13.058,                                    348\/E13.059,                                    348\/E13.061,                                    348\/E13.062,                                    348\/E13.072,                                    375\/240.25","Primary Class:":"348\/51","Publication Date:":1061424000000,"Title:":"Stereoscopic video"},{"Abstract:":"Disclosed is a system that generates correlated video signals that are acombination of separate video signals that interrelate to each other in some fashion. The separate video signals are transmitted through a transmission channel to a viewerlocation. Separate video decoders decode the video signals at the viewer location. Presentation description instructions are also transmitted to the viewer location and are used to generate control signals to control the combination of the video signals at the viewer location.","Application Number:":"PCT\/US2002\/008878","Assignee:":"INTELLOCITY USA, INC. (1400 Market Street Denver, CO, 80202, US)                \n                            Reynolds, Steven (1568 Meyerwood Circle Littleton, CO, 80129, US)                \n                            Lemmons, Thomas (7784 South Swaps Trail Evergreen, CO, 80439, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1016582400000,"International Classes:":"H04N7\/088; H04N7\/16; H04N7\/173; H04N7\/24; H04N21\/2343; H04N21\/2365; H04N21\/254; H04N21\/431; H04N21\/44; H04N21\/45; H04N21\/454; H04N21\/4725; H04N21\/6332; H04N21\/647; H04N21\/654; H04N21\/6543; H04N21\/81; H04N21\/8543; H04N21\/858; H04N5\/44; H04N5\/445; H04N5\/45; H04N21\/422; H04N21\/47; (IPC1-7): H04N7\/16","Inventors:":"Reynolds, Steven (1568 Meyerwood Circle Littleton, CO, 80129, US)                \n                            Lemmons, Thomas (7784 South Swaps Trail Evergreen, CO, 80439, US)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1032998400000,"Title:":"VIDEO COMBINER"},{"Abstract:":"A video system comprises a video signal generating device (1') and no less than one video signal receiving device (2') coupled to each other by means of a signal bus (4'). The video signal generating device (1') is capable of generating at an output (13) one or a plurality of video signals having each a different signal format (CVBS, Y\/C, MAC bb, .... ). The video signal receiving device(s) is (are) arranged for processing one or a plurality of video signals having mutually different formats. It is an object to establish which video signal format the devices (1', 2', 3') have in common (Y\/C) and to adjust the devices so that the video signal generating device generates at its output (13) just the video signal that has the common signal format concerned and the video signal receiving device(s) is (are) capable of processing the video signal that has the common signal format concerned and is applied to the input (24, 33). If two or more video signal formats appear to be common to the devices a choice is made in favour of one of these formats, preferably the video signal format having the highest video signal quality.","Application Number:":"EP19900203394","Assignee:":"PHILIPS NV (NL)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":661478400000,"International Classes:":"H04N7\/00; H04N5\/44; H04N9\/64; (IPC1-7): H04N9\/64","Inventors:":"Spiero, Richard Cees (NL)                \n                            Van, Groningen Theodorus Hendri (NL)","Other Classes:":null,"Primary Class:":null,"Publication Date:":680313600000,"Title:":"Video system."},{"Abstract:":"A digital video capture system for capturing a digital video sequence and for producing a corresponding video summary, comprising: an image sensor; an optical system; a processor, a softcopy display and a means for providing a user with an option to view either a stored digital video sequence or a video summary on the softcopy display. The processor performs the steps of: capturing a digital video sequence; automatically analyzing the digital video sequence at the time the digital video sequence is captured to determine one or more feature values; compressing the digital video sequence; storing the compressed digital video sequence; automatically analyzing the feature values to identify one or more key video snippets, assembling the key video snippets to form a video summary; and storing a representation of the video summary.","Application Number:":"12\/786501","Assignee:":"Intellectual Ventures Fund 83 LLC (Las Vegas, NV, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1274745600000,"International Classes:":"H04N5\/76; H04N5\/95; H04N11\/04","Inventors:":"Deever, Aaron T. (Pittsford, NY, US)","Other Classes:":"375\/240.01,                                    386\/353","Primary Class:":"348\/231.2","Publication Date:":1369094400000,"Title:":"Video capture system producing a video summary"},{"Abstract:":"A network node apparatus (1) is disclosed for the capture, storage and replay of video data at separate respective nodes of a communications network arranged to operably couple the node apparatus. The node apparatus may include a video capture node (2) operable to capture video data and to transmit captured data via the communications network (11 - 20) to a video storage node (3). The video storage node is arranged to store captured video data, and to transmit stored data via the communications network (11 - 20) to a video replay node (4) which renders an image therefrom. The video storage node transmits video data to the video replay node only if the content of a transmit buffer therein matches or exceeds a predetermined lower content value and the content of a receive buffer in the replay node does not exceed a predetermined upper content value.","Application Number:":"PCT\/EP2004\/051857","Assignee:":"THALES UK PLC (2 Dashwood Lang Road, The Bourne Business Park Addlestone near Weybridge, Surrey KT152NX, GB)                \n                            Gregory, Lawrence (MARKS & CLERK FRANCE, 31-33 Avenue Aristide Briand, Arcueil Cedex, F-94117, FR)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1092960000000,"International Classes:":"H04N7\/24; (IPC1-7): H04N7\/24","Inventors:":"Gregory, Lawrence (MARKS & CLERK FRANCE, 31-33 Avenue Aristide Briand, Arcueil Cedex, F-94117, FR)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1111017600000,"Title:":"VIDEO SYSTEM"},{"Abstract:":"There is provided with a video composition method including: scaling each of I input video images with a plurality of scaling factors to generate a plurality of scaled input video images every input video image; writing the scaled input video images generated every input video image into predetermined regions in a video storage unit; reading out video image signals from the video storage unit on the basis of each of J video layout information pieces, the video layout information prescribing layout of the input video images when the input video images are composed; and generating a composite video image from the video image signals read out from the video storage unit every video layout information pieces.","Application Number:":"11\/332461","Assignee:":"Kabushiki Kaisha Toshiba (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1137456000000,"International Classes:":"H03M13\/27; H04N7\/14; A61B5\/11; B60C23\/00; G06F11\/16; G06F11\/20; G06F13\/38; G06F21\/62; G06Q10\/00; G06Q30\/00; G07F17\/16; G08B13\/196; G08B15\/00; G09C1\/00; H03M13\/23; H03M13\/29; H04B1\/00; H04B1\/38; H04B1\/69; H04B1\/707; H04B7\/005; H04B7\/02; H04B7\/06; H04B7\/08; H04B7\/216; H04B7\/26; H04B14\/04; H04J13\/02; H04J99\/00; H04K1\/00; H04L1\/00; H04L1\/06; H04L1\/08; H04L1\/18; H04L9\/00; H04L9\/06; H04L9\/10; H04L9\/14; H04L9\/32; H04L12\/02; H04L12\/12; H04L12\/24; H04L12\/26; H04L12\/28; H04L12\/40; H04L12\/54; H04L12\/64; H04L27\/26; H04L29\/02; H04L29\/04; H04L29\/06; H04L29\/08; H04L29\/12; H04L29\/14; H04M1\/26; H04M1\/663; H04M1\/725; H04M3\/42; H04M3\/46; H04M11\/00; H04N5\/00; H04N5\/14; H04N5\/225; H04N5\/76; H04N7\/01; H04N7\/08; H04N7\/12; H04N7\/16; H04N7\/24; H04N7\/68; H04N9\/74; H04W4\/06; H04W4\/12; H04W4\/16; H04W8\/02; H04W8\/08; H04W8\/18; H04W16\/02; H04W16\/28; H04W24\/00; H04W24\/04; H04W28\/04; H04W40\/24; H04W52\/48; H04W60\/06; H04W72\/04; H04W74\/08; H04W76\/02; H04W88\/02; H04W88\/08; H04W88\/10; H04J13\/00; H04N5\/445; H04N5\/781; H04N9\/804; H04W8\/00; H04W48\/16; H04W72\/08; H04W84\/12","Inventors:":"Tanaka, Shingo (Yokohama-Shi, JP)                \n                            Kamagata, Eiji (Kamakura-Shi, JP)                \n                            Tsuda, Yoshiyuki (Kawasaki-Shi, JP)","Other Classes:":"348\/584,                                    348\/E5.053,                                    348\/E7.084,                                    348\/E9.055","Primary Class:":"348\/14.09","Publication Date:":1154563200000,"Title:":"Video composition apparatus, video composition method and video composition program"},{"Abstract:":"There is provided a video processing apparatus including a video addition unit for receiving two systems of input interlaced video signals each including two fields, and adding the video signals to generate a ½× video signal of the input interlaced video signal. The video addition unit adds a second field of the interlaced video signal of one system among the two systems and a first field of the interlaced video signal of the other system to generate the ½× video signal of the input interlaced video signal, subjects the interlaced video signal of the other system to 1 horizontal line delay when the ½× video signal is generated, validates a horizontal line in a vertical blanking interval on one row of a top line of valid lines in the first field of the interlaced video signal of the other system, and then adds the video signals of the two systems.","Application Number:":"13\/434986","Assignee:":"SONY CORPORATION (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1333065600000,"International Classes:":"H04N7\/01; H04N21\/236","Inventors:":"Hashi, Mayuki (Kanagawa, JP)                \n                            Kamiya, Koji (Kanagawa, JP)                \n                            Yamauchi, Kiyoshi (Kanagawa, JP)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1436227200000,"Title:":"Video processing apparatus and video processing method"},{"Abstract:":"In an embodiment, a computing device may display a video browser screen on an output device. The video browser screen may include a list of video programs arranged as a carousel. The carousel may have a plurality of entries, where an entry may represent a video program that may be provided by a service provider. A video program represented by an entry may be, for example, a live video program, a video program available on demand, or a video program that may have been recorded by a device that may be provided by the service provider. The computing device may acquire an indication to navigate to an entry in the carousel. The computing device may navigate to the entry and acquire an indication to select the entry. The computing device may select the entry and display the video program associated with the selected entry on the output device.","Application Number:":"13\/940100","Assignee:":"TIME WARNER CABLE ENTERPRISES LLC","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1373500800000,"International Classes:":"H04N21\/482; G06F3\/0482; G06F3\/0484","Inventors:":"Stark, James C. (Broomfield, CT, US)                \n                            Cottrell, Alix (Wayne, PA, US)","Other Classes:":null,"Primary Class:":"725\/40","Publication Date:":1421280000000,"Title:":"Video Browser"},{"Abstract:":"A video call center process and system can create cost effective video programs for television transmission from a multiplicity of simultaneous video callers with much less supporting staff.","Application Number:":"13\/589643","Assignee:":"WOLZIEN THOMAS R.","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1345420800000,"International Classes:":"G09G5\/00; H04N7\/14","Inventors:":"Wolzien, Thomas R. (Grandview-On-Hudson, NY, US)","Other Classes:":"348\/14.04,                                    348\/E7.078","Primary Class:":"345\/629","Publication Date:":1392854400000,"Title:":"Video Call Center"},{"Abstract:":"A video apparatus has a digital decoder generating a first digital stream, a video source of a first analogue signal, a video encoder and a first video decoder connectable to the video source for generating a second digital stream based on the first analogue signal. A switch is coupled to the first video decoder and to the digital decoder to notably mix the second digital stream and the first digital stream into an output digital stream to the video encoder.","Application Number:":"10\/521491","Assignee:":null,"Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1057708800000,"International Classes:":"H04N5\/44; H04N7\/26; H04N7\/46; H04N7\/50; H04N9\/64; H04N5\/45; H04N5\/46; H04N11\/20; (IPC1-7): H04N7\/12","Inventors:":"Dumont, Frank (Singapore, SG)                \n                            Tan, Chee Lam (Singapore, SG)","Other Classes:":"348\/E5.108,                                    348\/E5.112,                                    348\/E5.114,                                    348\/E9.039,                                    348\/E11.021,                                    375\/E7.211","Primary Class:":"375\/240.26","Publication Date:":1130371200000,"Title:":"Video apparatus"},{"Abstract:":"A video camera has a lens, an image sensor for generating a first video signal representative of a scenery which is imaged on the image sensor by said lens, an auxiliary image signal source providing a second video signal, an output interface for outputting a third video signal, and signal mixing means for combining said third video signal from said first and second video signals.","Application Number:":"10\/966287","Assignee:":null,"Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1097798400000,"International Classes:":"H04N5\/225; H04N5\/76; H04N19\/89","Inventors:":"Rooy, Jan Van ('s-Hertogenbosch, NL)                \n                            Rosica, Jeff James (Beverly Hills, CA, US)","Other Classes:":"348\/218.1,                                    348\/E5.053,                                    348\/E5.056,                                    348\/E5.058","Primary Class:":"348\/231.99","Publication Date:":1145491200000,"Title:":"Video camera"},{"Abstract:":"A system and method provides video recommendations for a target video in a video sharing environment. The system selects one or more videos that are on one or more video playlists together with the target video. The video co-occurrence data of the target video associates the target video and another video on one or more same video playlists and frequency of the target video and another video on the video playlists is computed. Based on the video co-occurrence data of the target video, one or more co-occurrence videos are selected and ranked based on the video co-occurrence data of the target video. The system selects one or more videos from the co-occurrence videos as video recommendations for the target video.","Application Number:":"13\/325369","Assignee:":"GOOGLE INC. (Mountain View, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1323820800000,"International Classes:":"G06N5\/00","Inventors:":"Wei, Li (Milpitas, CA, US)                \n                            Zhang, Kun (Mountain View, CA, US)                \n                            He, Yu (Sunnyvale, CA, US)                \n                            Cai, Xinmei (Tokyo, JP)","Other Classes:":null,"Primary Class:":"706\/54","Publication Date:":1371686400000,"Title:":"VIDEO RECOMMENDATION BASED ON VIDEO CO-OCCURRENCE STATISTICS"},{"Abstract:":"According to one embodiment, a video sender comprises: a video processor and a communication module. The video processor creates video. The communication module is configured to communicate with a video receiver. The communication module comprises: a receiver and a transmitter. The receiver receives, from the video receiver, specific information specifying which one of a color signal and a frame rate takes precedence over the other one in transmission. The transmitter converts the video created by the video processor into video in which one of the color signal and the frame rate takes precedence over the other one in accordance with the specific information, and transmit the video thus converted to the video receiver.","Application Number:":"14\/595482","Assignee:":"Kabushiki Kaisha Toshiba (Minato-ku, Tokyo, JP)                \n                            Toshiba Lifestyle Products & Services Corporation (Ome, Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1421107200000,"International Classes:":"H04N7\/00; G06F3\/00; G06F13\/00; G09G5\/00; H04N1\/00; H04N5\/04; H04N9\/47; H04N9\/475; H04N9\/64; H04N17\/00; H04N17\/02; H04N21\/432; H04N21\/4363; H04N21\/4402; H04N21\/462; H04N21\/485; G09G5\/36","Inventors:":"Minemura, Takashi (Ome Tokyo, JP)                \n                            Suzuki, Nobuaki (Akishima Tokyo, JP)                \n                            Doi, Takashi (Fuchu Tokyo, JP)                \n                            Miyasato, Hideki (Yokohama Kanagawa, JP)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1464652800000,"Title:":"Video sender and video receiver"},{"Abstract:":"A method of transmitting video, a method of receiving and decoding video, and a corresponding transmitter, receiver and computer program products. The method of transmitting video to one or more recipient terminals comprises: transmitting a stream of inter frame encoded video data to a recipient terminal; during ongoing transmission of the stream to the recipient terminal, receiving a request signal from that recipient terminal; and in response to the request signal, transmitting alternatively encoded video data to the recipient terminal in association with the inter frame encoded video data.","Application Number:":"12\/584579","Assignee:":"Skype (Dublin, IE)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1252368000000,"International Classes:":"H04N7\/12; H04N19\/89","Inventors:":"Zhao, David (Solna, SE)","Other Classes:":"375\/240.26","Primary Class:":"375\/240.12","Publication Date:":1341273600000,"Title:":"Video coding"},{"Abstract:":"A content receiver and a method for controlling the same are provided. The content receiver, for example, may include, but is not limited to, a communication system configured to receive video content comprising a plurality of video frames from a content source, a processor configured to insert artifacts into one or more video frames when the video frame is subject to data loss, and a video analyzer configured to determine a quality of the video content by quantifying an effect of the inserted artifacts into the one or more video frames, and trigger at least one content receiver response when the quality of the video content is less than a predetermined threshold.","Application Number:":"15\/654571","Assignee:":"Sling Media PVT Ltd. (Bangalore, IN)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1500422400000,"International Classes:":"H04N21\/44; G06K9\/00; G06K9\/46; G06T7\/00; H04N5\/44","Inventors:":"Kulkarni, Sushant Sudhir (Bangalore, IN)                \n                            Raikar, Yatish Naik J. (Banaglore, IN)                \n                            Tripathi, Varunkumar B. (Bangalore, IN)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1509580800000,"Title:":"VIDEO ANALYZER"},{"Abstract:":"A video processing system includes: a merge server configured to decode a plurality of individual videos provided from video providing units, encode the plurality of individual videos by adjusting an amount of data of each of the individual videos to generate a preliminary video, and provide the preliminary video; a display server configured to receive the preliminary video and configure final videos according to output conditions of a display device; and a control server configured to receive the output conditions from the display server and transfer an output control signal with respect to the preliminary video to the merge server. When a user wants, individual videos provided from the plurality of video providing units can be displayed on a display device without sacrificing resolution and a frame rate, and since videos can be zoomed in\/out and panned in real time, operational responsiveness and usage efficiency of the video processing system can be enhanced.","Application Number:":"14\/494757","Assignee:":"Innotive Inc. Korea (Seoul, KR)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1411516800000,"International Classes:":"H04N21\/2665; H04N5\/765; H04N5\/77; H04N9\/804; H04N21\/2187; H04N21\/2343; H04N21\/258","Inventors:":"Chang, Peter Taehwan (Seoul, KR)                \n                            Kim, Dae Hee (Seoul, KR)                \n                            Kim, Kyung Hun (Seoul, KR)                \n                            Lee, Jun Seok (Seoul, KR)                \n                            Chung, Jae Sung (Seoul, KR)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1459814400000,"Title:":"Video processing system and video processing method"},{"Abstract:":"Communicating information exchanged in a video conference. Responsive to detecting a change in an amount of audio information generated by at least one participant in the video conference, identifying a first of the plurality of participants in the video conference that currently is a primary presenter in the video conference, allocating a first level of video bandwidth to communicate video information generated in the video conference to a client device, by the primary presenter in the video conference, and allocating a second level of video bandwidth to communicate video information generated in the video conference to a client device, by one or more other participants, who currently are not the primary presenter in the video conference, wherein the second level of video bandwidth is less than the first level of video bandwidth.","Application Number:":"13\/561689","Assignee:":"Google Technology Holdings LLC (Mountain View, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1343606400000,"International Classes:":"H04N7\/14; H04L12\/18; H04L29\/06; H04N7\/15; H04N21\/2365; H04N21\/2385","Inventors:":"Valentine, Matthew F. (Chapel Hill, NC, US)                \n                            Ashley, James P. (Naperville, IL, US)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1440460800000,"Title:":"Video bandwidth allocation in a video conference"},{"Abstract:":"Video-Verteilsystem\nzum Verteilen eines Videos durch ein Netzwerk zu einem Client-Endgerät, umfassend: Video-Anordnungsinformations-Registriermittel,\ndie die Video-Anordnungsinformation\neiner Mehrzahl von Videoanordnungen registrieren auf einem Video-Anzeigebereich basierend\nauf einer Mitteilung des Client-Endgeräts; Video-Anordnungsinformationslisten-Übertragungsmittel, die\neine Liste von Video-Anordnungsinformation übertragen, die registriert\nist durch die Video-Anordnungsinformations-Registriermittel, zu\ndem Client-Endgerät;\nund Video-Verteilmittel, die das Video verteilen zu dem Client basierend\nauf einer Video-Verteilanforderung von dem Client-Endgerät basierend\nauf der Video-Anordnungsinformation, die von dem Client-Endgerät ausgewählt ist\nvon der Video-Anordnungsinformationsliste.","Application Number:":"DE112005000213","Assignee:":"Hitachi Kokusai Electric Inc. (Tokio\/Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1106265600000,"International Classes:":"H04N7\/18 H04N5\/76 H04N7\/173 H04N7\/16","Inventors:":"Murata, Shigeyuki (Kodaira, Tokyo, JP)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1198713600000,"Title:":"Video-Verteilgerät"},{"Abstract:":"A video compositing device includes: first video input means for inputting a first video; second video input means for inputting a second video; parameter input means for inputting a parameter indicating a relative positional relationship between the first video input by the first video input means and the second video input by the second video input means when the first and second videos are composited; video compositing means for compositing the first and second videos, in units of pixels, in accordance with the parameter input by the parameter input means, to generate a composite video; and output means for outputting a composite video generated by the video compositing means.","Application Number:":"EP20070021247","Assignee:":"Seiko Epson Corporation (4-1, Nishi-shinjuku 2-chome, Shinjuku-ku Tokyo 163-0811, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1193788800000,"International Classes:":"G09G5\/00; H04N5\/265; H04N5\/445; H04N7\/173","Inventors:":"Tamura, Akihiko (c\/o Seiko Epson Corporation3-5 Owa 3-chomeSuwa-shi, Nagano 392-8502, JP)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1222819200000,"Title:":"Video compositing device and video output device"},{"Abstract:":"In a method and system for performing a video call between a first terminal and a second terminal, video data for the video call is captured with a camera of the first terminal. The captured video data is transmitted in real-time to the second terminal for use in the video call. The captured video data is output in real-time at a display of the second terminal in the video call. A video hold input is received from a user at the first terminal to initiate a video hold state. Holding video data is determined for output at the display of the second terminal in the video hold state. In the video hold state, the determined holding video data is output at the display of the second terminal, instead of outputting video data captured by said camera of the first terminal in real-time at the display of the second terminal.","Application Number:":"13\/404511","Assignee:":"Microsoft Corporation (Redmond, WA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1330041600000,"International Classes:":"H04N7\/14; H04L29\/06","Inventors:":"Rosenberg, Jonathan (Freehold, NJ, US)","Other Classes:":null,"Primary Class:":"348\/14.01","Publication Date:":1419292800000,"Title:":"Video calling"},{"Abstract:":"An immersive video system for displays a view window of an environment using multiple video streams. The immersive video system includes a video source containing multiple overlapping video streams. An immersive video decoder selects an active video stream based on the location of the view window. A video decoder decodes the active video stream for the immersive video decoder. The immersive video decoder then selects the appropriate parts of the video stream to display in the view window.","Application Number:":"09\/625380","Assignee:":"Enroute, Inc. (Palo Alto, CA)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":964483200000,"International Classes:":"H04N7\/26; (IPC1-7): G06T17\/00","Inventors:":"Hashimoto, Roy T. (Redwood City, CA)","Other Classes:":"345\/473,                                    375\/E7.088,                                    375\/E7.137,                                    375\/E7.172,                                    375\/E7.182,                                    375\/E7.207","Primary Class:":"345\/427","Publication Date:":1053388800000,"Title:":"Immersive video system using multiple video streams"},{"Abstract:":"A system and method provides video recommendations for a target video in a video sharing environment. The system selects one or more videos that are on one or more video playlists together with the target video. The video co-occurrence data of the target video associates the target video and another video on one or more same video playlists and frequency of the target video and another video on the video playlists is computed. Based on the video co-occurrence data of the target video, one or more co-occurrence videos are selected and ranked based on the video co-occurrence data of the target video. The system selects one or more videos from the co-occurrence videos as video recommendations for the target video.","Application Number:":"14\/490542","Assignee:":"Google Inc. (Mountain View, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1410998400000,"International Classes:":"G06N5\/00; G06F17\/30; G06N5\/04; H04N21\/262; H04N21\/2668; H04N21\/442; H04N21\/482","Inventors:":"Wei, Li (Milpitas, CA, US)                \n                            Zhang, Kun (Mountain View, CA, US)                \n                            He, Yu (Sunnyvale, CA, US)                \n                            Cai, Xinmei (Tokyo, JP)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1477353600000,"Title:":"Video recommendation based on video co-occurrence statistics"},{"Abstract:":"A video conference video signal switching system is disclosed to include a local signal-transmitting side comprised of a video signal transmitter receiver unit and a selection control and power converter unit for allowing the user to switch 8 different input video signals for output, a remote signal-receiving side comprised of a 1˜8 channels video signal selector unit, a 1˜8 channels detection and local power supply unit, a microprocessor, and a video signal output unit, and a category-5 or category-6 network cable connected between the local signal-transmitting side and the remote signal-receiving side. By means of the control of the microprocessor, the user can selectively switch 8 different input video signals received from the local signal-transmitting side for output to an external display monitor via the video signal output unit.","Application Number:":"11\/902375","Assignee:":"C&C; TECHNIC TAIWAN CO., LTD. (Taipei Hsien, TW)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1190332800000,"International Classes:":"H04N7\/14","Inventors:":"Hsu, David (Taipei Hsien, TW)","Other Classes:":"348\/E7.083","Primary Class:":"348\/14.08","Publication Date:":1238025600000,"Title:":"Video conference video signal switching"},{"Abstract:":"According to one embodiment, a video sender comprises: a video processor and a communication module. The video processor creates video. The communication module is configured to communicate with a video receiver. The communication module comprises: a receiver and a transmitter. The receiver receives, from the video receiver, specific information specifying which one of a color signal and a frame rate takes precedence over the other one in transmission. The transmitter converts the video created by the video processor into video in which one of the color signal and the frame rate takes precedence over the other one in accordance with the specific information, and transmit the video thus converted to the video receiver.","Application Number:":"13\/774325","Assignee:":"KABUSHIKI KAISHA TOSHIBA (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1361491200000,"International Classes:":"H04N9\/64","Inventors:":"Minemura, Takashi (Tokyo, JP)                \n                            Suzuki, Nobuaki (Tokyo, JP)                \n                            Doi, Takashi (Tokyo, JP)                \n                            Miyasato, Hideki (Kanagawa, JP)","Other Classes:":null,"Primary Class:":"348\/720","Publication Date:":1386806400000,"Title:":"VIDEO SENDER AND VIDEO RECEIVER"},{"Abstract:":"A video processing system includes: a merge server configured to decode a plurality of individual videos provided from video providing units, encode the plurality of individual videos by adjusting an amount of data of each of the individual videos to generate a preliminary video, and provide the preliminary video; a display server configured to receive the preliminary video and configure final videos according to output conditions of a display device; and a control server configured to receive the output conditions from the display server and transfer an output control signal with respect to the preliminary video to the merge server. When a user wants, individual videos provided from the plurality of video providing units can be displayed on a display device without sacrificing resolution and a frame rate, and since videos can be zoomed in\/out and panned in real time, operational responsiveness and usage efficiency of the video processing system can be enhanced.","Application Number:":"13\/921650","Assignee:":"Innotive Inc. Korea (Seoul, KR)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1371600000000,"International Classes:":"H04N5\/77; H04N5\/765; H04N9\/804; H04N21\/2187; H04N21\/2343; H04N21\/258; H04N21\/2665","Inventors:":"Chang, Peter Taehwan (Seoul, KR)                \n                            Kim, Dae Hee (Seoul, KR)                \n                            Kim, Kyung Hun (Seoul, KR)                \n                            Lee, Jun Seok (Seoul, KR)                \n                            Chung, Jae Sung (Seoul, KR)","Other Classes:":"386\/210","Primary Class:":"386\/224","Publication Date:":1427155200000,"Title:":"Video processing system and video processing method"},{"Abstract:":"A method of and apparatus for efficiently providing video on demand services to a cable television subscriber. The provider system consists of two major subsystems. The first subsystem, called a video server, streams video to video on demand subscribers through the cable television network. The second subsystem, called the transaction server, performs virtually all remaining provider functions including, security, accounting, storage and spooling of video data, etc. The video server is preferably uses a Unisys CMP memory platform into which the transaction server spools requested video programs. One or more industry standard processors operating under a standard operating system stream the video data from the memory platform to the subscriber.","Application Number:":"09\/304906","Assignee:":"Unisys Corporation (Blue Bell, PA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":925776000000,"International Classes:":"H04N7\/73","Inventors:":"Sipple, Ralph E. (Shoreview, MN, US)                \n                            Mcbreen, James R. (Shoreview, MN, US)                \n                            Stanton, Michael F. (Lino Lakes, MN, US)","Other Classes:":"725\/91","Primary Class:":"725\/93","Publication Date:":1344902400000,"Title:":"Video server"},{"Abstract:":"Provided are a video-signal switching method and a video receiver having two functions: a switching function between video signals in a currently-active system and in a backup system; and a switching function between two different videos. The present invention provides a video transmission system including video transmitters, a network connected to the video transmitters, and a video receiver connected to the network and configured to receive video streams of two IP-packetized video contents from the video transmitters. The video receiver has: a function of switching from an outputting video stream, which is continuously received but no longer receivable, to the other video stream of the same video content; and functions of stopping receiving one of the two video streams from the video transmitters, receiving the other video stream having a different video content, and switching the outputting video stream to the other video stream thus received.","Application Number:":"15\/258532","Assignee:":"Media Global Links Co., Ltd. (Kawasaki-shi, Kanagawa, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1473206400000,"International Classes:":"H04N7\/173; H04N21\/234; H04N21\/24; H04N21\/438; H04N21\/44; H04N21\/442; H04N21\/4425; H04N21\/462; H04N21\/643; H04N21\/647","Inventors:":"Nakamura, Kazunori (Kawasaki, JP)                \n                            Narita, Kazuki (Kawasaki, JP)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1514246400000,"Title:":"Video transmission system and video receiver"},{"Abstract:":"A video card is controlled by a control unit to output video data to a display or through a network. The video card includes a network interface, an interface controller and a bus interface. The network interface is connected to the network to transfer the video data. The interface controller is coupled to the network interface and controlled by the control unit to output the video data to the display or through the network interface. The bus interface is coupled between the interface controller and the control unit and is for inputting the video data from the control unit to the interface controller.","Application Number:":"11\/142513","Assignee:":"Aten International Co., Ltd. (Taipei County, TW)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1117584000000,"International Classes:":"G06F13\/14; G06F15\/00; G09G5\/36","Inventors:":"Liu, Yi-li (Sijhih, TW)                \n                            Chen, Sun-chung (Sijhih, TW)","Other Classes:":null,"Primary Class:":"345\/520","Publication Date:":1222732800000,"Title:":"Video card"},{"Abstract:":"A network node apparatus is disclosed for the capture, storage and replay of video data at separate respective nodes of a communications network arranged to operably couple the node apparatus. The node apparatus may include a video capture node operable to capture video data and to transmit captured data via the communications network to a video storage node. The video storage node is arranged to store captured video data, and to transmit stored data via the communications network to a video replay node which renders an image therefrom. The video storage node transmits video data to the video replay node only if the content of a transmit buffer therein matches or exceeds a predetermined lower content value and the content of a receive buffer in the replay node does not exceed a predetermined upper content value.","Application Number:":"10\/571095","Assignee:":null,"Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1092960000000,"International Classes:":"H04N5\/91; H04N7\/24","Inventors:":"Gregory, Lawrence (West Sussex, GB)","Other Classes:":"375\/E7.014,                                    375\/E7.019","Primary Class:":"386\/264","Publication Date:":1167868800000,"Title:":"Video system"},{"Abstract:":"Some embodiments provide a method of processing digital video in a computer. The method receives a first video clip. It stores the first video clip at a first rate in a storage of the computer. From the first video clip, the method generates a second video clip that is at a second rate different than the first rate. The method then outputs the second video clip from the computer. In some embodiments, the first rate is the native rate that a camera originally shot at least a portion of the first video clip, and the second rate is an encoded rate. In some embodiments, the method generates the second video clip from the first video by using the 2:3:3:2 encoding format. Also, in some embodiments, the method outputs the second video clip as the method generates the second video clip.","Application Number:":"13\/274252","Assignee:":"Apple Inc. (Cupertino, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1318550400000,"International Classes:":"H04N5\/765","Inventors:":"Black, David Robert (Sunnyvale, CA, US)","Other Classes:":null,"Primary Class:":"386\/232","Publication Date:":1393891200000,"Title:":"Video encoding"},{"Abstract:":"There is provided a video processing apparatus including a video addition unit for receiving two systems of input interlaced video signals each including two fields, and adding the video signals to generate a ½x video signal of the input interlaced video signal. The video addition unit adds a second field of the interlaced video signal of one system among the two systems and a first field of the interlaced video signal of the other system to generate the ½x video signal of the input interlaced video signal, subjects the interlaced video signal of the other system to 1 horizontal line delay when the ½x video signal is generated, validates a horizontal line in a vertical blanking interval on one row of a top line of valid lines in the first field of the interlaced video signal of the other system, and then adds the video signals of the two systems.","Application Number:":"13\/434986","Assignee:":"HASHI MAYUKI                \n                            KAMIYA KOJI                \n                            YAMAUCHI KIYOSHI","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1333065600000,"International Classes:":"H04N7\/01","Inventors:":"Hashi, Mayuki (Kanagawa, JP)                \n                            Kamiya, Koji (Kanagawa, JP)                \n                            Yamauchi, Kiyoshi (Kanagawa, JP)","Other Classes:":"348\/E7.003","Primary Class:":"348\/448","Publication Date:":1349913600000,"Title:":"VIDEO PROCESSING APPARATUS AND VIDEO PROCESSING METHOD"},{"Abstract:":"A video refocusing system operates in connection with refocusable video data, information, images and\/or frames, which may be light field video data, information, images and\/or frames, that may be focused and\/or refocused after acquisition or recording. A video acquisition device acquires first refocusable light field video data of a scene, stores first refocusable video data representative of the first refocusable light field video data, acquires second refocusable light field video data of the scene after acquiring the first refocusable light field video data, determines a first virtual focus parameter (such as a virtual focus depth) using the second refocusable light field video data, generates first video data using the stored first refocusable video data and the first virtual focus parameter, wherein the first video data includes a focus depth that is different from an optical focus depth of the first refocusable light field video data, and outputs the first video data.","Application Number:":"14\/273349","Assignee:":"Lytro, Inc. (Mountain View, CA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1399507200000,"International Classes:":"H04N5\/232; H04N13\/02","Inventors:":"Pitts, Colvin (Snohomish, WA, US)                \n                            Ng, Yi-ren (Palo Alto, CA, US)","Other Classes:":null,"Primary Class:":"348\/46","Publication Date:":1409184000000,"Title:":"Video Refocusing"},{"Abstract:":"In one embodiment, comparing a first video provided by a user with a second video associated with an object; authenticating the user based on whether the first video matches the second video; and granting the user access to the object when the first video sufficiently matches the second video.","Application Number:":"13\/348089","Assignee:":"TSENG ERICK","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1326240000000,"International Classes:":"H04N7\/18","Inventors:":"Tseng, Erick (San Francisco, CA, US)","Other Classes:":"348\/E7.085","Primary Class:":"348\/156","Publication Date:":1373500800000,"Title:":"Video Passcode"},{"Abstract:":"A video recording device includes imaging circuitry, processing circuitry, and communication circuitry. The imaging circuitry is configured to generate image data for a scene being imaged. The processing circuitry is configured to generate first video data using the image data. The communication circuitry is configured to wirelessly send the first video data to another video recording device and to wirelessly receive second video data from the other video recording device. The processing circuitry is further configured to controllably switch during a recording of a video from storing portions of the first video data as part of the video to storing portions of the second video data as part of the video.","Application Number:":"12\/848529","Assignee:":null,"Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1280707200000,"International Classes:":"H04N5\/77; H04N5\/775; H04N5\/92; H04N5\/928","Inventors:":"Sobaje, Justin Mark (Los Angeles, CA, US)","Other Classes:":"386\/337,                                    386\/338,                                    386\/E5.02,                                    386\/E5.021,                                    386\/E5.069,                                    386\/E5.07,                                    386\/230","Primary Class:":"386\/224","Publication Date:":1296691200000,"Title:":"Video Recording Devices and Video Recording Methods"},{"Abstract:":"A video display device including:\n\nan external tuner video reception unit that obtains, from an external device having a reception tuner to receive a video signal, a video signal received by the reception tuner;an internal reception tuner that receives a video signal;a video control unit that controls so that the external tuner video reception unit receives a video signal of each channel; anda display control unit that controls to display a video signal received by the external tuner video reception unit in real time and the video signal received by the internal reception tuner at the same time on a screen.","Application Number:":"12\/618904","Assignee:":"Sony Corporation (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1258329600000,"International Classes:":"H04N5\/445; H04N5\/44; H04N5\/45; H04N5\/765; H04N7\/14; H04N7\/173; H04N21\/41; H04N21\/426; H04N21\/431; H04N21\/482","Inventors:":"Yuki, Taichi (Tokyo, JP)","Other Classes:":"348\/14.02,                                    348\/563,                                    348\/734,                                    386\/231","Primary Class:":"348\/564","Publication Date:":1381795200000,"Title:":"Video display device, video display system, and video display method"},{"Abstract:":"A video thumbnail for use as an icon of a digital video file and method of generating same. The video thumbnail is preferably a relatively short, low resolution, animated video thumbnail. The video thumbnail is extracted from a preferred sequence of the video file and embedded as a header of the file. The video thumbnail preferably plays automatically, and acts as a pointer to the file and the preferred point within it.","Application Number:":"10\/299939","Assignee:":"STAVELY DONALD J.                \n                            CAZIER ROBERT P.                \n                            BATTLES AMY E.                \n                            OWENS JAMES W.                \n                            VOSS JAMES S.                \n                            DALTON DAN L.","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1037664000000,"International Classes:":"H04N5\/76; G06F3\/023; G06F3\/048; H04N5\/91; H04N5\/45; (IPC1-7): G09G5\/00","Inventors:":"Stavely, Donald J. (Windsor, CO, US)                \n                            Cazier, Robert P. (Fort Collins, CO, US)                \n                            Battles, Amy E. (Windsor, CO, US)                \n                            Owens, James W. (Fort Collins, CO, US)                \n                            Voss, James S. (Fort Collins, CO, US)                \n                            Dalton, Dan L. (Greeley, CO, US)","Other Classes:":"348\/E5.112","Primary Class:":"715\/838","Publication Date:":1085011200000,"Title:":"Video thumbnail"},{"Abstract:":"There are provided a video player for outputting a video signal which enables a monitor to easily, reliably detect that a signal is in a letterbox format and a video system having the video player. When the aspect ratio of video data is 16:9, the video player converts the video data into an NTSC signal in a letterbox format, outputting the thus-converted NTSC signal. In addition, the video player adds a closed caption signal to specific lines in a vertical blanking period, and each piece of 2-byte data is set to space. A 16:9 aspect ratio monitor receives an NTSC signal distributed by a distributor; detects that the closed caption signal is added to the NTSC signal and that data about the closed caption signal is space; and displays a main video in an zooming-in manner. A 4:3 aspect ratio monitor displays the main video as is.","Application Number:":"14\/851682","Assignee:":"TEAC Corporation (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1441929600000,"International Classes:":"H04N7\/01; G06F3\/041; H04N5\/445; H04N7\/025","Inventors:":"Kato, Masato (Saitama-ken, JP)                \n                            Kaku, Daisuke (Tokyo, JP)                \n                            Hosonuma, Shinichi (Saitama-ken, JP)                \n                            Nakano, Atsuki (Tokyo, JP)","Other Classes:":null,"Primary Class:":"348\/445","Publication Date:":1458172800000,"Title:":"VIDEO PLAYER AND VIDEO SYSTEM"},{"Abstract:":"A selector selects a video signal from video signals input via any of a plurality of video input terminals, and outputs the thus-selected video signal. A plurality of video signal detection sections determine whether or not video signals are being supplied from the plurality of video input terminals. When a video signal is newly detected, a plurality of video signal determination sections determine a format of the video signal. A signal processing section performs, on the video signal output from the selector, signal processing in accordance with a result of the determination output from the signal determination sections. When the video signal is newly detected during a period in which no video signal is being supplied to the plurality of video input terminals, control means causes the selector to select the thus-detected video signal.","Application Number:":"11\/376171","Assignee:":"KABUSHIKI KAISHA TOSHIBA (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1142467200000,"International Classes:":"H04N5\/268; H04N5\/44","Inventors:":"Okubo, Katsuaki (Oume-shi, JP)","Other Classes:":"348\/E5.057","Primary Class:":"348\/706","Publication Date:":1160006400000,"Title:":"Video apparatus"},{"Abstract:":"Example video composition systems and methods involve scaling each of multiple input video images with scaling factors to generate a plurality of scaled input video images each corresponding to one of the input video images. The scaled input video images are written into regions in a video storage unit. Video image signals are read out from the video storage unit on the basis of each of multiple video layout information pieces, the video layout information prescribing layout of the input video images when the input video images are composed. A composite video image is generated from the video image signals read out from the video storage unit for every video layout information pieces piece.","Application Number:":"11\/332461","Assignee:":"Kabushiki Kaisha Toshiba (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1137456000000,"International Classes:":"G09G5\/00; H03M13\/27; A61B5\/11; B60C23\/00; G06F11\/16; G06F11\/20; G06F13\/38; G06F21\/62; G06K9\/32; G06Q10\/00; G06Q30\/00; G07F17\/16; G08B13\/196; G08B15\/00; G09C1\/00; H03M13\/23; H03M13\/29; H04B1\/00; H04B1\/38; H04B1\/69; H04B1\/707; H04B7\/005; H04B7\/02; H04B7\/06; H04B7\/08; H04B7\/216; H04B7\/26; H04B14\/04; H04J13\/02; H04J99\/00; H04K1\/00; H04L1\/00; H04L1\/06; H04L1\/08; H04L1\/18; H04L9\/00; H04L9\/06; H04L9\/10; H04L9\/14; H04L9\/32; H04L12\/02; H04L12\/12; H04L12\/24; H04L12\/26; H04L12\/28; H04L12\/40; H04L12\/54; H04L12\/64; H04L27\/26; H04L29\/02; H04L29\/04; H04L29\/06; H04L29\/08; H04L29\/12; H04L29\/14; H04M1\/26; H04M1\/663; H04M1\/725; H04M3\/42; H04M3\/46; H04M11\/00; H04N5\/00; H04N5\/14; H04N5\/225; H04N5\/76; H04N7\/01; H04N7\/08; H04N7\/12; H04N7\/16; H04N7\/24; H04N7\/68; H04W4\/06; H04W4\/12; H04W4\/16; H04W8\/02; H04W8\/08; H04W8\/18; H04W16\/02; H04W16\/28; H04W24\/00; H04W24\/04; H04W28\/04; H04W40\/24; H04W52\/48; H04W60\/06; H04W72\/04; H04W74\/08; H04W76\/02; H04W88\/02; H04W88\/08; H04W88\/10; H04J13\/00; H04N5\/445; H04N5\/781; H04N9\/804; H04W8\/00; H04W48\/16; H04W72\/08; H04W84\/12","Inventors:":"Tanaka, Shingo (Yokohama, JP)                \n                            Kamagata, Eiji (Kamakura, JP)                \n                            Tsuda, Yoshiyuki (Kawasaki, JP)","Other Classes:":"382\/298","Primary Class:":"345\/660","Publication Date:":1314057600000,"Title:":"Video composition apparatus, video composition method and video composition program"},{"Abstract:":"There is provided video switching circuitry for use in a KVM switch and similar devices. Video signal switching circuitry can supply video signals from a one of a plurality of video sources connected to the circuit to a display device connected to the circuit. The high data signalling rate signals are converted into a greater number of lower data signalling rate signals for switching by a bus architecture. Also provided are video display systems in which analogue and digital video signals are switched synchronously to allow them to be displayed on common or separate display devices. Also described is a high-resolution monitor digital video data switching device.","Application Number:":"11\/747192","Assignee:":"Adder Technology Limited (Cambridge, GB)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1178755200000,"International Classes:":"G06F13\/12; G06F3\/00; H04N5\/268","Inventors:":"Dickens, Nigel Anthony (Cambridge, GB)                \n                            Dickens, Adrian Christopher (Cambridge, GB)                \n                            Haylock, William (Cambs, GB)","Other Classes:":"710\/2,                                    710\/63","Primary Class:":"710\/62","Publication Date:":1370908800000,"Title:":"Video switch"},{"Abstract:":"There is provided a method for displaying a video signal (31; 46) on a display (20; 44), a video receiver (32; 43), and software. When the video signal is received, the video receiver displays the video pictures of the video signal within a reduced-size window (24; 50) on the display. Then, the size of the reduced-size window is gradually increased, and the video receiver simultaneously detects the format of the video pictures. Once the format of the video pictures has been detected, the size of the window continues to be increased, but taking into account the detected format, thereby finally giving a full-size window (26; 55) that matches the format of the video pictures.","Application Number:":"12\/600659","Assignee:":"Trident Microsystems ( Far East) Ltd. a corporation","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1212710400000,"International Classes:":"H04N5\/44; H04N7\/16","Inventors:":"Jilagam, Pradeep Kumar (Hyderabad, IN)","Other Classes:":"348\/E5.096","Primary Class:":"348\/553","Publication Date:":1279756800000,"Title:":"VIDEO RECEIVER"},{"Abstract:":"A method of decoding encoded video data, the encoded video data being arranged as a plurality of video picture segments, the data of the video picture segments being arranged so that all header data for the segment are transmitted together and all motion vector data for the segment are transmitted together, the header data and motion vector data being separated by markers, the method comprising:  receiving encoded video data; attempting to decode header information of an encoded video segment; when an attempt to decode all of the header information of an encoded video segment is unsuccessful, attempting to decode the motion vectors for the encoded video segment and,  when the motion vectors for the encoded video segment have been successfully decoded, using the motion vectors with any successfully decoded header information.","Application Number:":"EP20020251864","Assignee:":"British, Telecomm (GB)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1016150400000,"International Classes:":"G06T9\/00; H04N19\/895; (IPC1-7): H04N7\/68","Inventors:":null,"Other Classes:":null,"Primary Class:":null,"Publication Date:":1063756800000,"Title:":"Video processing"},{"Abstract:":"A video apparatus has a digital decoder generating a first digital stream, a video source of a first analogue signal, a video encoder and a first video decoder connectable to the video source for generating a second digital stream based on the first analogue signal. A switch is coupled to the first video decoder and to the digital decoder to notably mix the second digital stream and the first digital stream into an output digital stream to the video encoder.","Application Number:":"10\/521491","Assignee:":"Thomson Licensing (Boulogne-Billancourt, FR)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1057708800000,"International Classes:":"H04N5\/932; H04N5\/44; H04N5\/93; H04N5\/935; H04N7\/26; H04N7\/46; H04N7\/50; H04N9\/64; H04N5\/45; H04N5\/46; H04N11\/20","Inventors:":"Dumont, Frank (Singapore, SG)                \n                            Tan, Chee Lam (Singapore, SG)","Other Classes:":"386\/353","Primary Class:":"386\/201","Publication Date:":1291680000000,"Title:":"Video apparatus"},{"Abstract:":"A methodic and apparatus for video decoding including receiving encoded video data; decoding the video data to form decoded video data and determining if the decoded the video data contains an error. When it is determined that an error is present, a message is sent to a transmitting video encoder requesting an update of at least the portion of the video data containing the error, wherein the update message is only sent if a pre-determined period has elapsed since a previous update message was sent. A complementary encoder is also described.","Application Number:":"09\/506277","Assignee:":"Nokia Mobile Phones Limited (Espoo, FI)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":950745600000,"International Classes:":"H04N19\/89; H04N7\/173; H04N7\/24; H04N7\/50; H04N19\/895; (IPC1-7): H04N7\/12","Inventors:":"Hannuksela, Miska (Tampere, FI)                \n                            Hourunranta, Ari (Tampere, FI)","Other Classes:":"375\/240.25,                                    375\/E7.016,                                    375\/E7.211,                                    375\/E7.224,                                    375\/E7.279,                                    375\/E7.281","Primary Class:":"375\/240.27","Publication Date:":1061856000000,"Title:":"Video coding"},{"Abstract:":"Interactive video may involve user controlled characters. Additional interaction in broadcast interactive video may be provided by using video objects (3, 3′) and detecting any coincidence between a user controlled character (2) and the video objects. If coincidence is detected, an event may be triggered. Such an event may involve device control of the user controlled character","Application Number:":"10\/596597","Assignee:":"KONINKLIJKE PHILIPS ELECTRONICS N.V. (GROENEWOUDSEWEG 1, EINDHOVEN, NL)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1102032000000,"International Classes:":"G06T15\/70; A63F13\/12","Inventors:":"Heesemans, Michael (Eindhoven, NL)","Other Classes:":null,"Primary Class:":"345\/473","Publication Date:":1187827200000,"Title:":"Interactive Video"},{"Abstract:":"In some embodiments, a spatially multiplexed output decoder may spatially multiplex video packets received in a time multiplexed video stream. A video stream with video packets from two or more sources may be received along with metadata. In some embodiments, a decoder may organize the video packets into respective buffers (e.g., each buffer including video packets for a respective video image). The spatially multiplexed output decoder may spatially multiplex the video images (which are made up of data from the respective video packets) into a video frame to be outputted (e.g., to a separate buffer). The video images in the video frame may then be demultiplexed in other parts of the system (e.g., in a virtual decoder) using information provided about the video frame (e.g., in metadata formed with the video frame).","Application Number:":"12\/142377","Assignee:":"LifeSize Communications, Inc. (Austin, TX, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1213833600000,"International Classes:":"H04N7\/14","Inventors:":"King, Keith C. (Austin, TX, US)                \n                            Mock, Wayne E. (Round Rock, TX, US)","Other Classes:":"348\/14.01,                                    348\/14.07,                                    375\/240.01","Primary Class:":"348\/14.08","Publication Date:":1390262400000,"Title:":"Video decoder which processes multiple video streams"},{"Abstract:":"A content receiver and a method for controlling the same are provided. The content receiver, for example, may include, but is not limited to, a communication system configured to receive video content comprising a plurality of video frames from a content source, a processor configured to insert artifacts into one or more video frames when the video frame is subject to data loss, and a video analyzer configured to determine a quality of the video content by quantifying an effect of the inserted artifacts into the one or more video frames, and trigger at least one content receiver response when the quality of the video content is less than a predetermined threshold.","Application Number:":"14\/860313","Assignee:":"SLING MEDIA PVT LTD (Bangalore, IN)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1442793600000,"International Classes:":"G06K9\/00; G06K9\/46; G06T7\/00; G06T7\/40; H04N5\/44; H04N21\/44","Inventors:":"Kulkarni, Sushant Sudhir (Bangalore, IN)                \n                            Raikar, Yatish Naik J. (Banaglore, IN)                \n                            Tripathi, Varunkumar B. (Bangalore, IN)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1503964800000,"Title:":"Video analyzer"},{"Abstract:":"When one video image (e.g., second video image) is blended or synthesized to video image (e.g., main video image), time base correction is made between both video data. A video data processing apparatus comprising a first video generator generating a first video data having an arbitrary frame rate, a second video generator generating a second video data having an arbitrary frame rate different from the first video data, and a synchronization controller using video reproduction time managed by the first video generator as a reference time, and correcting video reproduction time of the second video generator shifted from the reference time by repeatedly using the second video data to obtain frame synchronization.","Application Number:":"11\/099455","Assignee:":"Kabushiki Kaisha Toshiba (Tokyo, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1112745600000,"International Classes:":"G06T3\/00; H04N9\/74; G06F3\/14; G11B27\/10; H04N1\/387; H04N5\/265; H04N5\/956","Inventors:":"Kobayashi, Takero (Akishima, JP)","Other Classes:":"348\/586,                                    348\/589,                                    348\/597","Primary Class:":"348\/584","Publication Date:":1226966400000,"Title:":"Video data processing apparatus"},{"Abstract:":"Videos are retargeted to a target display for viewing with little to no geometric distortion or video information loss. Salient regions of video frames may be determined using scale-space spatiotemporal information. Video information loss may be a result of spatial loss, due to cropping, and resolution loss, due to resizing. A desired cropping window may be determined using a coarse-to-fine searching strategy. Video frames may be cropped with a window that matches an aspect ratio of the target display, and resized isotropically to match a size of the target display.","Application Number:":"12\/060890","Assignee:":"Microsoft Technology Licensing, LLC (Redmond, WA, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1207094400000,"International Classes:":"H04N7\/01; G06K9\/20; G06T11\/00; H04N1\/387; H04N11\/20; H04N21\/2662","Inventors:":"Hua, Gang (Redmond, WA, US)                \n                            Zhang, Cha (Redmond, WA, US)                \n                            Zhang, Zhengyou (Redmond, WA, US)                \n                            Liu, Zicheng (Bellevue, WA, US)                \n                            Shan, Ying (Sammamish, WA, US)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1453161600000,"Title:":"Video retargeting"},{"Abstract:":"A new user interface and display system for a video display device with a touch screen makes it possible to peek at, that is view briefly, a selected video content while watching other content. During a video peek, video from a second video source will be seen to partially displace and temporarily replace a portion of a video presently being viewed. Selection of the other video sources can be controlled, for example, by swiping with one, two, three or four finger tips and by swiping inwardly from any one of the four edges of a video display. Moreover, the video presently being viewed can be interchanged with the video being peeked at.","Application Number:":"14\/236105","Assignee:":"Thomas Licensing (Issy Les Moulineaux, FR)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1329782400000,"International Classes:":"G06F3\/01; G06F3\/0346; G06F3\/041; G06F3\/0482; G06F3\/0488; G11B27\/34; H04N21\/431; H04N21\/438","Inventors:":"Wardenaar, Matthew Jacob (Sherman Oaks, CA, US)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1444089600000,"Title:":"Video peeking"},{"Abstract:":"According to one embodiment, a video sender (20) comprises: a video creator (203, 204) and a communication module (200). The video creator (203, 204) creates video data. The communication module (200) is configured to communicate with a video receiver (10). The communication module (200) comprises: a receiver (254) and a transmitter (252). The receiver (254) receives, from the video receiver (10), specific information specifying which one of a color signal and a frame rate takes precedence over the other one of the color signal and the frame rate when transmitting the video data. The transmitter (252) converts the video data created by the video creator (203, 204) into video data in which one of the color signal and the frame rate takes precedence over the other one of the color signal and the frame rate in accordance with the specific information, and transmits the video data thus converted to the video receiver (10).","Application Number:":"EP20130153335","Assignee:":"Kabushiki Kaisha Toshiba (1-1, Shibaura 1-chome, Minato-ku,\nTokyo 105-8001, JP)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1359504000000,"International Classes:":"G09G5\/00; H04N21\/00","Inventors:":"Minemura, Takashi c\/o Toshiba Corporation (Intellectual PropertyDivision1-1, Shibaura 1-chome, Minato-ku, Tokyo, 105-8001, JP)                \n                            Suzuki, Nobuaki c\/o Toshiba Corporation (Intellectual PropertyDivision1-1, Shibaura 1-chome, Minato-ku, Tokyo, 105-8001, JP)                \n                            Doi, Takashi c\/o Toshiba Corporation (Intellectual PropertyDivision1-1, Shibaura 1-chome, Minato-ku, Tokyo, 105-8001, JP)                \n                            Miyasato, Hideki c\/o Toshiba Corporation (Intellectual PropertyDivision1-1, Shibaura 1-chome, Minato-ku, Tokyo, 105-8001, JP)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1387324800000,"Title:":"Video sender and video receiver"},{"Abstract:":"There is provided video switching circuitry for use in a KVM switch and similar devices. Video signal switching circuitry can supply video signals from a one of a plurality of video sources connected to the circuit to a display device connected to the circuit. The high data signalling rate signals are converted into a greater number of lower data signalling rate signals for switching by a bus architecture. Also provided are video display systems in which analogue and digital video signals are switched synchronously to allow them to be displayed on common or separate display devices. Also described is a high-resolution monitor digital video data switching device.","Application Number:":"10\/211887","Assignee:":"Adder Technology Limited","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1028160000000,"International Classes:":"H04N5\/268; (IPC1-7): H04N5\/253","Inventors:":"Dickens, Nigel Anthony (Cambridge, GB)                \n                            Dickens, Adrian Christopher (Cambridge, GB)                \n                            Haylock, William (Cambs, GB)","Other Classes:":"348\/E5.057","Primary Class:":"348\/100","Publication Date:":1045699200000,"Title:":"Video switch"},{"Abstract:":"In an embodiment, a computing device may display a video browser screen on an output device. The video browser screen may include a list of video programs arranged as a carousel. The carousel may have a plurality of entries, where an entry may represent a video program that may be provided by a service provider. A video program represented by an entry may be, for example, a live video program, a video program available on demand, or a video program that may have been recorded by a device that may be provided by the service provider. The computing device may acquire an indication to navigate to an entry in the carousel. The computing device may navigate to the entry and acquire an indication to select the entry. The computing device may select the entry and display the video program associated with the selected entry on the output device.","Application Number:":"13\/940100","Assignee:":"Time Warner Cable Enterprises LLC (St. Louis, MO, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1373500800000,"International Classes:":"H04N5\/445; H04N21\/482; H04N21\/422; H04N21\/488","Inventors:":"Stark, James C. (Broomfield, CT, US)                \n                            Cottrell, Alexandra (Wayne, PA, US)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1522108800000,"Title:":"Video browser"},{"Abstract:":"A method, system, and medium are provided for delivering broadcast video content at varying levels of video quality. In particular, a source video stream is provided that is divided into two or more video substreams such that the video substreams include offset frames from the source video stream. The video substreams are modulated onto one or more air interface channels. Mobile devices may be configured to access only one of the video substreams to present video content at a lower frame rate or to access multiple video substreams to present video content at a higher frame rate.","Application Number:":"11\/858645","Assignee:":"Sprint Communications Company L.P. (Overland Park, KS, US)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1190246400000,"International Classes:":"H04H20\/28; H04L12\/16; H04M3\/42; H04N7\/16","Inventors:":"Woleben, Samuel M. (Lenexa, KS, US)","Other Classes:":"370\/265,                                    455\/414.1,                                    725\/62,                                    725\/86","Primary Class:":"370\/487","Publication Date:":1416873600000,"Title:":"Enhancing video quality for broadcast video services"},{"Abstract:":"A content receiver and a method for controlling the same are provided. The content receiver, for example, may include, but is not limited to, a communication system configured to receive video content comprising a plurality of video frames from a content source, and a video analyzer configured to determine when compression of the video content is causing blockiness in one or more of the plurality of video frames, and trigger at least one content receiver response when the compression of the video content is causing blockiness in one or more of the plurality of video frames.","Application Number:":"15\/627628","Assignee:":"SLING MEDIA PVT LTD (Bangalore, IN)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1497916800000,"International Classes:":"H04N19\/154; H04N17\/04; H04N19\/14; H04N19\/176; H04N19\/86","Inventors:":"Kulkami, Sushant Sudhir (Bangalore, IN)                \n                            Thammineni, Arunoday (Bangalore, IN)                \n                            Raikar, Yatish Naik J. (Bangalore, IN)                \n                            Tripathi, Varunkumar B. (Bangalore, IN)","Other Classes:":null,"Primary Class:":null,"Publication Date:":1507161600000,"Title:":"VIDEO ANALYZER"},{"Abstract:":"A content receiver and a method for controlling the same are provided. The content receiver, for example, may include, but is not limited to, a communication system configured to receive video content comprising a plurality of video frames from a content source, and a video analyzer configured to determine when compression of the video content is causing blockiness in one or more of the plurality of video frames, and trigger at least one content receiver response when the compression of the video content is causing blockiness in one or more of the plurality of video frames.","Application Number:":"14\/860300","Assignee:":"SLING MEDIA PVT LTD (Bangalore, IN)","Export Citation:":"Click for automatic bibliography\n                generation","Filing Date:":1442793600000,"International Classes:":"H04N19\/54; H04N17\/04; H04N19\/14; H04N19\/154; H04N19\/176; H04N19\/86","Inventors:":"Kulkarni, Sushant Sudhir (Bangalore, IN)                \n                            Thammineni, Arunoday (Bangalore, IN)                \n                            Raikar, Yatish Naik J. (Bangalore, IN)                \n                            Tripathi, Varunkumar B. (Bangalore, IN)","Other Classes:":null,"Primary Class:":"1\/1","Publication Date:":1498521600000,"Title:":"Video analyzer"}]